assessments-650/Lesson2/Education650Lesson2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-03 Thu 19:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Intro To Types!</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Curtis D'Alves" />
<meta name="description" content="Org mode syntax example"
 />
<meta name="keywords" content="syntax, org, document" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Intro To Types!</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org667ca1c">Introduction</a>
<ul>
<li><a href="#org7aefb3c">What is a type?</a></li>
<li><a href="#orgda613a4">Running Code With Replit.com</a></li>
</ul>
</li>
<li><a href="#org16094cd">Learning Objective</a></li>
<li><a href="#org3fb0ec1">Playing With Types</a>
<ul>
<li><a href="#orga6ec594">The print function</a></li>
<li><a href="#org0447bc0">The + function</a></li>
<li><a href="#orgeb22935">Type errors</a></li>
</ul>
</li>
<li><a href="#org756e4a0">Challenge</a></li>
<li><a href="#org3ffc146">Summary</a></li>
</ul>
</div>
</div>
<p>
This is a sample asynchronous lesson on introductory type theory in computer
science developed using the BOPPPS model for submission to <b>EDUCATION 650</b> at
<b>McMaster University</b>
</p>

<div id="outline-container-org667ca1c" class="outline-2">
<h2 id="org667ca1c">Introduction</h2>
<div class="outline-text-2" id="text-org667ca1c">
</div>
<div id="outline-container-org7aefb3c" class="outline-3">
<h3 id="org7aefb3c">What is a type?</h3>
<div class="outline-text-3" id="text-org7aefb3c">
<ul class="org-ul">
<li>A type is a name for a collection of related values. For example,
<code>True</code> and <code>False</code> are two <b>values</b> of <b>type</b> <code>Bool</code></li>
<li><p>
The <b>Python</b> programming language has the following four
<b>primitive types</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Primitive Python Types</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Values</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>Integer</code></td>
<td class="org-left">-2,-1,0,1,2,etc</td>
</tr>

<tr>
<td class="org-left"><code>Float</code></td>
<td class="org-left">-0.5,1.5,1000.0,etc</td>
</tr>

<tr>
<td class="org-left"><code>String</code></td>
<td class="org-left">"Hello",'Hello',"Goodbye",etc</td>
</tr>

<tr>
<td class="org-left"><code>Bool</code></td>
<td class="org-left">True,False</td>
</tr>
</tbody>
</table></li>
</ul>
</div>

<div id="outline-container-org3abfa9a" class="outline-4">
<h4 id="org3abfa9a">Integers</h4>
<div class="outline-text-4" id="text-org3abfa9a">
<p>
An <code>Integer</code> is any whole number from negative infinity to infinity
</p>
</div>
</div>
<div id="outline-container-org4b68f44" class="outline-4">
<h4 id="org4b68f44">Float</h4>
<div class="outline-text-4" id="text-org4b68f44">
<p>
<code>Float</code> stands for "floating point number". It is used to represent numbers
with a decimal figure
</p>
</div>
</div>
<div id="outline-container-org61cf2fc" class="outline-4">
<h4 id="org61cf2fc">String</h4>
<div class="outline-text-4" id="text-org61cf2fc">
<p>
A <code>String</code> is any "string" of characters enclosed inside double or single
quotes, such as <code>"Hello"</code> or <code>'hello'</code>
</p>
</div>
</div>
<div id="outline-container-org0909cef" class="outline-4">
<h4 id="org0909cef">Bool</h4>
<div class="outline-text-4" id="text-org0909cef">
<p>
A <code>Bool</code> or Boolean is a <code>True</code> or <code>False</code> value
</p>
</div>
</div>
</div>

<div id="outline-container-orgda613a4" class="outline-3">
<h3 id="orgda613a4">Running Code With Replit.com</h3>
<div class="outline-text-3" id="text-orgda613a4">
<ul class="org-ul">
<li>For the purposes of this lesson, we'll be coding in the <b>Python</b> programming
language</li>
<li>To run python code (if you don't already have a python editor), I recommend
using the online coding platform <a href="https://replit.com/languages/python3">https://replit.com/languages/python3</a></li>
<li>Please watch the following video for a quick overview of how to use replit</li>
</ul>

<iframe width="420" height="315"
src="https://www.youtube.com/embed/OxjoO5_07nw" frameborder="0" allowfullscreen>
</iframe>
</div>
</div>
</div>

<div id="outline-container-org16094cd" class="outline-2">
<h2 id="org16094cd">Learning Objective</h2>
<div class="outline-text-2" id="text-org16094cd">
<p>
By the end of this lesson, you'll be able to recognize values for the four
primitive types and fix basic errors caused by type mismatch
</p>
</div>
</div>


<div id="outline-container-org3fb0ec1" class="outline-2">
<h2 id="org3fb0ec1">Playing With Types</h2>
<div class="outline-text-2" id="text-org3fb0ec1">
<p>
In this section, you'll learn how to use some simple functions like <code>print</code>
and <code>+</code> and how they interact with different types. Please try <b>running all
the code you see here with replit</b>
</p>
</div>

<div id="outline-container-orga6ec594" class="outline-3">
<h3 id="orga6ec594">The print function</h3>
<div class="outline-text-3" id="text-orga6ec594">
<ul class="org-ul">
<li><p>
As you've already seen, the <code>print</code> function can be used to output strings
to the screen. For example, to output <code>Curtis is Great</code> use the code
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Curtis is Great"</span><span style="color: #3a81c3;">)</span>
</pre>
</div></li>
<li><p>
You can also give the <code>print</code> function other types, such as integers
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org0447bc0" class="outline-3">
<h3 id="org0447bc0">The + function</h3>
<div class="outline-text-3" id="text-org0447bc0">
<ul class="org-ul">
<li><p>
The <code>+</code> function can be used to combine <code>Strings</code>, for example
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"Hello "</span> + <span style="color: #2d9574;">"World"</span><span style="color: #3a81c3;">)</span>
</pre>
</div></li>
<li><p>
But the <code>+</code> function can also be used to add <code>Integers</code> or <code>Floats</code>, for example
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span> + <span style="color: #4e3163;">2</span><span style="color: #3a81c3;">)</span>
</pre>
</div></li>
<li><b>Note</b> the above example does not output <code>1 + 2</code> but rather <code>3</code> (i.e. the
result of an addition. This behavior (the same function having different
functionality for different types) is known as <b>overloading</b></li>
</ul>
</div>
</div>

<div id="outline-container-orgeb22935" class="outline-3">
<h3 id="orgeb22935">Type errors</h3>
<div class="outline-text-3" id="text-orgeb22935">
<ul class="org-ul">
<li><p>
What happens when you attempt to combine a <code>String</code> and an <code>Int</code> using <code>+</code>?
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">x</span> = <span style="color: #4e3163;">1</span>
<span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"x = "</span> + x<span style="color: #3a81c3;">)</span>
</pre>
</div></li>
<li><p>
You get the following error
</p>
<pre class="example" id="org2d828ea">
Traceback (most recent call last):
   File "main.py", line 2, in &lt;module&gt;
      print("x = " + x)
TypeError: can only concatenate str (not "int") to str
</pre></li>
<li><p>
This is known as a <code>type error</code>, it can be fixed by converting <code>x</code> to a
<code>String</code> using the <code>str</code> function
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">x</span> = <span style="color: #4e3163;">1</span>
<span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"x = "</span> + <span style="color: #3a81c3;">str</span><span style="color: #6c3163;">(</span>x<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org756e4a0" class="outline-2">
<h2 id="org756e4a0">Challenge</h2>
<div class="outline-text-2" id="text-org756e4a0">
<ul class="org-ul">
<li>Just like the <code>str</code> function converts a value of a different type to type
<code>String</code>, the <code>int</code> function converts a value to type <code>Integer</code></li>
<li><p>
Use the <code>int</code> function to fix the following code
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">x</span> = <span style="color: #2d9574;">"5"</span>
<span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span> + x<span style="color: #3a81c3;">)</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org3ffc146" class="outline-2">
<h2 id="org3ffc146">Summary</h2>
<div class="outline-text-2" id="text-org3ffc146">
<ul class="org-ul">
<li>Functions in Python are built for easy <b>overloading</b>, which makes for very
powerful functionality, but also causes many type errors</li>
<li>Being able to identify type errors and fix them by performing the correct
conversions is a necessary skill for being an effective programmer</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Curtis D'Alves</p>
<p class="date">Created: 2022-02-03 Thu 19:31</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
